cfd/templates/openfoam-aero/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  {{simulation_type}};

RAS
{
    RASModel        {{turbulence_model}};
    turbulence      on;
    printCoeffs     on;
}
