cfd/templates/openfoam-aero/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// Кинематическое давление: p/rho. Отсюда и требование §3.7 записывать
// плотность рядом с коэффициентом — сама по себе величина здесь не в паскалях.
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    {{wall_patches}}
    {
        type            zeroGradient;
    }
}
