cfd/templates/openfoam-aero/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{k}};

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform {{k}};
        value           uniform {{k}};
    }

    {{wall_patches}}
    {
        type            kqRWallFunction;
        value           uniform {{k}};
    }
}
