cfd/templates/openfoam-aero/0/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

// Поле Спаларта—Аллмараса. Лежит здесь всегда, а читается решателем только при
// `solver.turbulence: SpalartAllmaras`. Так проверка чувствительности к модели
// (§4.4) — это правка одного поля манифеста, а не другой шаблон: два шаблона
// на две модели неизбежно разошлись бы ещё в чём-нибудь.
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform {{nu_tilda}};

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform {{nu_tilda}};
        value           uniform {{nu_tilda}};
    }

    {{wall_patches}}
    {
        type            fixedValue;
        value           uniform 0;
    }
}
