cfd/templates/openfoam-aero/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform {{nut}};

boundaryField
{
    farfield
    {
        type            calculated;
        value           uniform {{nut}};
    }

    {{wall_patches}}
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}
