cfd/templates/openfoam-aero/system/meshQualityDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

// Пороги качества стоят отдельным файлом нарочно: они одинаковы для всех
// шаблонов, и разойтись между воздухом и водой им незачем. Ослабление любого
// из них — событие, которое обязано быть видно в diff одной строкой.
maxNonOrtho         65;
maxBoundarySkewness 20;
maxInternalSkewness 4;
maxConcave          80;
minVol              1e-13;
minTetQuality       1e-15;
minArea             -1;
minTwist            0.02;
minDeterminant      0.001;
minFaceWeight       0.02;
minVolRatio         0.01;
minTriangleTwist    -1;
nSmoothScale        4;
errorReduction      0.75;
